{
  "channel": {
    "title": "World News Headlines, Latest International News, World Breaking News - Times of India",
    "link": "https://timesofindia.indiatimes.com/world",
    "description": "World News: TOI brings the latest world news headlines, Current International\n        breaking news world wide. In depth analysis and top news headlines world wide.",
    "language": "en-gb",
    "lastBuildDate": "2023-12-26T14:58:33+05:30",
    "copyright": "Copyright:(C) Tue, 26 Dec 2023 14:58:33 IST Bennett Coleman Co. Ltd,\n        http://in.indiatimes.com/policyterms/1554651.cms",
    "docs": "http://syndication.indiatimes.com/",
    "image": {
      "title": "World News Headlines, Latest International News, World Breaking News - Times of India",
      "url": "https://timesofindia.indiatimes.com/photo/507610.cms",
      "link": "https://timesofindia.indiatimes.com/world"
    },
    "item": [
      {
        "title": "A Turkish parliamentary committee resumes debate on Sweden's Nato bid",
        "description": {
          "#text": "The Turkish\n            parliament's foreign affairs committee is deliberating on Sweden's bid to join Nato.\n            President Erdogan linked Sweden's admission to US approval of Turkey's request to\n            purchase F-16 fighter jets. Erdogan called for simultaneous actions by the US Congress\n            and Turkish parliament on these matters. He also urged Canada and other Nato allies to\n            lift arms embargoes on Turkey. Ratification process for Sweden's membership has stalled\n            in the Turkish parliament due to concerns over security and issues that need\n            clarification. Sweden and Finland joined Nato following Russia's invasion of Ukraine.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/europe/a-turkish-parliamentary-committee-resumes-debate-on-swedens-nato-bid/articleshow/106289523.cms",
        "guid": "https://timesofindia.indiatimes.com/world/europe/a-turkish-parliamentary-committee-resumes-debate-on-swedens-nato-bid/articleshow/106289523.cms",
        "pubDate": "2023-12-26T14:34:53+05:30",
        "enclosure": ""
      },
      {
        "title": "Thousands of Chinese migrants cross border as US Marks 80th anniversary of repeal of\n            exclusion act",
        "description": {
          "#text": "As the US marks the\n            80th anniversary of the repeal of the Chinese Exclusion Act, thousands of Chinese\n            immigrants are crossing the US-Mexico border after witnessing a decline in the Chinese\n            economy. From January through September, over 24,000 Chinese migrants crossed the border\n            without authorization, about 13 times the number recorded during the same period last\n            year. Chinese migrants who cross into the US without authorization usually wait for\n            agents from the US Border Patrol to pick them up. Chinese migrants were granted asylum\n            nearly 67% of the time in immigration courts over the past two decades.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/us/thousands-of-chinese-migrants-cross-border-as-us-marks-80th-anniversary-of-repeal-of-exclusion-act/articleshow/106288763.cms",
        "guid": "https://timesofindia.indiatimes.com/world/us/thousands-of-chinese-migrants-cross-border-as-us-marks-80th-anniversary-of-repeal-of-exclusion-act/articleshow/106288763.cms",
        "pubDate": "2023-12-26T14:09:59+05:30",
        "enclosure": ""
      },
      {
        "title": "Lose a limb or risk death? Growing numbers among Gaza's thousands of war-wounded face\n            hard decisions",
        "description": {
          "#text": "Doctors in Gaza face\n            a lack of vascular surgeons and proper treatment due to Israeli airstrikes, resulting in\n            an increase in amputations. The acute lack of medical supplies and overcrowding in\n            hospitals has forced many to have limbs amputated. The conflict has left Gaza's health\n            system overwhelmed, with thousands of people displaced and basic supplies scarce. The\n            risk of post-op infections is high due to poor hygiene and limited resources. Many\n            amputees struggle to adjust to their new lives. Shaimaa Nabahin, an ambitious university\n            student, hopes to leave Gaza and install a prosthetic limb to live a normal life.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/middle-east/lose-a-limb-or-risk-death-growing-numbers-among-gazas-thousands-of-war-wounded-face-hard-decisions/articleshow/106285806.cms",
        "guid": "https://timesofindia.indiatimes.com/world/middle-east/lose-a-limb-or-risk-death-growing-numbers-among-gazas-thousands-of-war-wounded-face-hard-decisions/articleshow/106285806.cms",
        "pubDate": "2023-12-26T12:41:47+05:30",
        "enclosure": ""
      },
      {
        "title": "Taiwan man charged over voter trips to China ahead of election",
        "description": {
          "#text": "A Taiwanese man has\n            been charged with violating election and anti-infiltration laws for arranging sponsored\n            visits to China ahead of Taiwan's pivotal poll in January. Officials have warned of\n            China's influence on voters and its pressure on Taiwan. The man belongs to a pro-Beijing\n            civic group and was funded by an infiltration source to promote candidates and provide\n            unfair benefits to voters. The opposition Kuomintang party, known as the 'pan-blue'\n            camp, is supported by Chinese authorities.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/rest-of-world/taiwan-man-charged-over-voter-trips-to-china-ahead-of-election/articleshow/106285165.cms",
        "guid": "https://timesofindia.indiatimes.com/world/rest-of-world/taiwan-man-charged-over-voter-trips-to-china-ahead-of-election/articleshow/106285165.cms",
        "pubDate": "2023-12-26T12:18:53+05:30",
        "enclosure": ""
      },
      {
        "title": "Right to protest is under threat in Britain, undermining democracy",
        "description": {
          "#text": "For holding a sign\n            outside a courthouse reminding jurors of their right to acquit defendants, a retiree\n            faces up to two years in prison. For hanging a banner reading Just Stop Oil off a\n            bridge, an engineer got a three-year prison sentence. Just for walking slowly down the\n            street, scores of people have been arrested. They are among hundreds of environmental\n            activists arrested for peaceful demonstrations in the UK, where tough new laws restrict\n            the right to protest. The Conservative government says the laws prevent extremist\n            activists from hurting the economy and disrupting daily life.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/uk/right-to-protest-is-under-threat-in-britain-undermining-a-pillar-of-democracy/articleshow/106283614.cms",
        "guid": "https://timesofindia.indiatimes.com/world/uk/right-to-protest-is-under-threat-in-britain-undermining-a-pillar-of-democracy/articleshow/106283614.cms",
        "pubDate": "2023-12-26T11:35:23+05:30",
        "enclosure": ""
      },
      {
        "title": "Ukraine claims destruction of major Russian navy vessel in Crimea",
        "description": {
          "#text": "Ukraine's air force\n            said on Tuesday that it had destroyed a major Russia landing ship stationed in the\n            Crimean waters, after the Russian-installed governor of Crimea said that Kyiv's assault\n            sparked a fire in the port of Feodosia. \"And the fleet in Russia is getting smaller and\n            smaller! Thanks to the Air Force pilots and everyone involved for the filigree work!\"\n            the commander of Ukraine's air force, Mykola Oleshchuk, said on the Telegram messaging\n            app, without providing evidence.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/europe/ukraine-claims-destruction-of-major-russian-navy-vessel-in-crimea/articleshow/106283129.cms",
        "guid": "https://timesofindia.indiatimes.com/world/europe/ukraine-claims-destruction-of-major-russian-navy-vessel-in-crimea/articleshow/106283129.cms",
        "pubDate": "2023-12-26T11:17:23+05:30",
        "enclosure": ""
      },
      {
        "title": "Indonesia nickel plant explosion death toll rises to 18",
        "description": {
          "#text": "The death toll from\n            the explosion at a Chinese-funded nickel-processing plant in Indonesia has risen to 18.\n            The incident has raised concerns about working conditions at Beijing's investment\n            facilities. The explosion occurred during repairs on a furnace when residual slag came\n            in contact with flammable materials. The majority of the victims suffered burns to over\n            70% of their bodies. This is not the first incident at facilities funded by Chinese\n            companies, raising further concerns about safety.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/south-asia/indonesia-nickel-plant-explosion-death-toll-rises-to-18/articleshow/106281697.cms",
        "guid": "https://timesofindia.indiatimes.com/world/south-asia/indonesia-nickel-plant-explosion-death-toll-rises-to-18/articleshow/106281697.cms",
        "pubDate": "2023-12-26T10:30:40+05:30",
        "enclosure": ""
      },
      {
        "title": "China expects searing heat, more weather extremes in 2024",
        "description": {
          "#text": "China's National\n            Climate Center predicts that China will experience scorching heat and an increase in\n            extreme weather next year due to the El Nino weather phenomenon. This year, China\n            experienced some of its hottest temperatures on record as well as a severe cold snap.\n            The chief expert of China's National Climate Center warns that 2024 may be even hotter\n            and bring more frequent and powerful extreme weather events. This past summer, Beijing\n            experienced record heat and a remote township in northwest China recorded the hottest\n            temperature on record. Typhoons also caused widespread flooding in China's north.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/china/china-expects-searing-heat-more-weather-extremes-in-2024/articleshow/106281413.cms",
        "guid": "https://timesofindia.indiatimes.com/world/china/china-expects-searing-heat-more-weather-extremes-in-2024/articleshow/106281413.cms",
        "pubDate": "2023-12-26T10:19:15+05:30",
        "enclosure": ""
      },
      {
        "title": "Israel PM says Hamas must be destroyed for peace",
        "description": {
          "#text": "Israeli Prime\n            Minister Benjamin Netanyahu vows to continue fighting in Gaza until Hamas is destroyed,\n            defying calls for a ceasefire as concerns rise over the potential spread of the conflict\n            amidst US-Iran tensions. Netanyahu dismisses speculation of a halt to the fighting and\n            emphasizes the need for military pressure to free remaining hostages held by Hamas.\n            Israeli operations intensify, resulting in a rising death toll and increased airstrikes.\n            Meanwhile, diplomatic efforts for a ceasefire have been rejected by Hamas and Islamic\n            Jihad, who are also holding hostages.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/middle-east/israel-pm-says-hamas-must-be-destroyed-for-peace-us-iran-backed-militants-clash/articleshow/106280916.cms",
        "guid": "https://timesofindia.indiatimes.com/world/middle-east/israel-pm-says-hamas-must-be-destroyed-for-peace-us-iran-backed-militants-clash/articleshow/106280916.cms",
        "pubDate": "2023-12-26T10:02:24+05:30",
        "enclosure": ""
      },
      {
        "title": "China unveils a new naval chief as maritime tensions climb",
        "description": {
          "#text": "China unveils new\n            head of navy, Hu Zhongming, promoted to general in Beijing ceremony attended by\n            President Xi Jinping. Hu is now commander of the largest navy by number of vessels. Dong\n            Jun, the head of the navy in 2021, also attended the ceremony. Tensions rise in South\n            China Sea and Taiwan Strait as China flexes its muscles. Chinese military holds major\n            drills around Taiwan and vows to bring Taiwan under Beijing's control. Wang Wenquan is\n            the new political commissar of the Southern Theater Command.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/china/china-unveils-a-new-naval-chief-as-maritime-tensions-climb/articleshow/106280626.cms",
        "guid": "https://timesofindia.indiatimes.com/world/china/china-unveils-a-new-naval-chief-as-maritime-tensions-climb/articleshow/106280626.cms",
        "pubDate": "2023-12-26T09:53:51+05:30",
        "enclosure": ""
      },
      {
        "title": "'Taiwan not seeing signs of large-scale Chinese military act pre-election'",
        "description": {
          "#text": "Taiwan is not seeing\n            any signs of large-scale Chinese military activity before elections next month but is\n            keeping a close watch on China, the island's defence ministry said on Tuesday. As the\n            election approaches Taiwan has been reporting Chinese fighter jets and warships around\n            the island, as well as balloons crossing the sensitive Taiwan Strait, though the\n            military says they are most likely for weather monitoring purposes. Taiwan's defence\n            ministry gives a daily update on Chinese military activities near the island, including\n            how many aircraft it has detected.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/rest-of-world/taiwan-not-seeing-signs-of-large-scale-chinese-military-activity-pre-election-defence-ministry/articleshow/106280307.cms",
        "guid": "https://timesofindia.indiatimes.com/world/rest-of-world/taiwan-not-seeing-signs-of-large-scale-chinese-military-activity-pre-election-defence-ministry/articleshow/106280307.cms",
        "pubDate": "2023-12-26T09:39:05+05:30",
        "enclosure": ""
      },
      {
        "title": "US strikes sites used by Iran-backed forces in retaliation to attack on troops",
        "description": {
          "#text": "The US military\n            conducted targeted air strikes in Iraq in response to a drone attack by Iran-aligned\n            militias. President Biden authorized the precision air strikes to hold accountable those\n            responsible for attacks on coalition forces. General Michael Erik Kurilla stated that\n            the strikes aimed to degrade militants' ability to continue such attacks. The\n            retaliatory strikes likely resulted in casualties among Kataib Hezbollah militants and\n            the destruction of facilities used by the group. The drone attack targeted a military\n            base used by US and anti-jihadist coalition forces.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/us/us-strikes-sites-used-by-iran-backed-forces-in-retaliation-to-attack-on-troops/articleshow/106278252.cms",
        "guid": "https://timesofindia.indiatimes.com/world/us/us-strikes-sites-used-by-iran-backed-forces-in-retaliation-to-attack-on-troops/articleshow/106278252.cms",
        "pubDate": "2023-12-26T08:23:21+05:30",
        "creator": "TOI World Desk",
        "enclosure": ""
      },
      {
        "title": "In a first, Hindu woman files nomination in Pakistan general elections",
        "description": {
          "#text": "Saveera Parkash, a\n            member of the Hindu community in Khyber Pakhtunkhwa's Buner district, has officially\n            filed nomination papers to contest a general seat in the upcoming Pakistan general\n            elections. Running under the banner of the Pakistan People's Party (PPP), Parkash\n            follows in the footsteps of her father, Oam Parkash, a retired doctor and dedicated PPP\n            member. She is the first woman from Buner to vie for a general seat and has highlighted\n            the historical neglect and suppression of women in the region.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/pakistan/in-a-first-hindu-woman-files-nomination-in-khyber-pakhtunkhwas-buner-seat-in-pakistan-general-elections/articleshow/106277801.cms",
        "guid": "https://timesofindia.indiatimes.com/world/pakistan/in-a-first-hindu-woman-files-nomination-in-khyber-pakhtunkhwas-buner-seat-in-pakistan-general-elections/articleshow/106277801.cms",
        "pubDate": "2023-12-26T08:04:02+05:30",
        "creator": "TOI World Desk",
        "enclosure": ""
      },
      {
        "title": "Pakistan president Alvi approves removal of PM's adviser Ahad Cheema",
        "description": {
          "#text": "President Arif Alvi\n            approved the removal of advisor Ahad Cheema on the instruction of ECP. The removal was\n            sought by advocate Syed Azizuddin Kakakhel to ensure transparent elections. ECP ruled\n            that Cheema's removal was reasonable to prevent his influence on elections. Cheema's\n            immediate removal was ordered by ECP. The petition also seeks the removal of Anwarul Haq\n            Kakar, Fawad Hasan Fawad, and Syed Tauqir Hussain Shah. The plea stated that the\n            involvement of these individuals in the caretaker government would compromise the\n            transparency of the upcoming elections.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-president-alvi-approves-removal-of-pms-adviser-ahad-cheema/articleshow/106279352.cms",
        "guid": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-president-alvi-approves-removal-of-pms-adviser-ahad-cheema/articleshow/106279352.cms",
        "pubDate": "2023-12-26T08:53:45+05:30",
        "enclosure": ""
      },
      {
        "title": "'Israel economy to shrink 2% as war sidelines workers'",
        "description": {
          "#text": "The Israeli economy\n            is expected to shrink by 2% this quarter due to the war with Hamas, leading to a spike\n            in unemployment. About 900,000 people were called up to fight, resulting in a\n            significant portion of the work force being missing from the labor market. The number of\n            people filing for unemployment benefits since the start of the war is 191,666. The\n            tourism, construction and agriculture sectors are experiencing severe labor shortages,\n            as Palestinian workers have been barred from entering Israel.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/middle-east/israel-economy-to-shrink-2-as-war-sidelines-workers/articleshow/106276809.cms",
        "guid": "https://timesofindia.indiatimes.com/world/middle-east/israel-economy-to-shrink-2-as-war-sidelines-workers/articleshow/106276809.cms",
        "pubDate": "2023-12-26T06:18:36+05:30",
        "enclosure": ""
      },
      {
        "title": "In Christmas Day message, pope decries Gaza's 'appalling harvest' of civilian deaths",
        "description": {
          "#text": "Pope Francis\n            delivers Christmas message, highlighting children dying in wars, Israeli strikes in\n            Gaza, and the abominable attack by Hamas militants. He calls for an end to conflicts in\n            Ukraine, Syria, Yemen, Lebanon, Armenia, and Azerbaijan, and defends the rights of\n            migrants. Francis criticizes the armaments industry and calls for investigation into the\n            rise of arms production, sales, and trade. He emphasizes the need for dialogue and\n            international support for a two-state solution in Israel and Palestine.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/us/in-christmas-day-message-pope-decries-gazas-appalling-harvest-of-civilian-deaths/articleshow/106276746.cms",
        "guid": "https://timesofindia.indiatimes.com/world/us/in-christmas-day-message-pope-decries-gazas-appalling-harvest-of-civilian-deaths/articleshow/106276746.cms",
        "pubDate": "2023-12-26T06:02:11+05:30",
        "enclosure": ""
      },
      {
        "title": "US judge okays suit against X over unpaid bonuses to go on",
        "description": {
          "#text": "A federal judge has\n            allowed a lawsuit against social media company X to proceed. The lawsuit, filed by Mark\n            Schobinger, a former senior director of compensation for Twitter, claims that the\n            company promised but never paid millions of dollars in bonuses. Schobinger alleges that\n            Twitter orally promised employees 50% of their 2022 targeted bonuses if they stayed with\n            the company in the first quarter of 2023. The judge ruled that Schobinger had plausibly\n            stated a breach of contract claim under California law. The judge also determined that\n            California law governed the case, rejecting Twitter's arguments.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/us/us-judge-okays-suit-against-x-over-unpaid-bonuses-to-go-on/articleshow/106276633.cms",
        "guid": "https://timesofindia.indiatimes.com/world/us/us-judge-okays-suit-against-x-over-unpaid-bonuses-to-go-on/articleshow/106276633.cms",
        "pubDate": "2023-12-26T05:40:27+05:30",
        "enclosure": ""
      },
      {
        "title": "For Ukrainians, Christmas comes early, but not a moment too soon",
        "description": {
          "#text": "Ukraine's Ukrainian\n            Orthodox Church switched from the Julian church calendar to celebrate Christmas on\n            December 25, aligning with most of Europe and distancing itself from Russia's tradition.\n            The shift brought joy to families, who celebrated the holiday earlier and exchanged\n            presents. The change is seen as a step toward Europe and away from Russia's influence.\n            Most parishes in the Ukrainian Orthodox Church followed the recommendation to change the\n            date, with only a few still adhering to the Julian calendar.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/europe/for-ukrainians-christmas-comes-early-but-not-a-moment-too-soon/articleshow/106276593.cms",
        "guid": "https://timesofindia.indiatimes.com/world/europe/for-ukrainians-christmas-comes-early-but-not-a-moment-too-soon/articleshow/106276593.cms",
        "pubDate": "2023-12-26T05:31:16+05:30",
        "enclosure": ""
      },
      {
        "title": "Attacks kill at least 160 people in central Nigeria",
        "description": {
          "#text": "Armed groups have\n            killed at least 160 people in central Nigeria in a series of attacks on villages, local\n            government officials said on Monday. \"As many as 113 persons have been confirmed killed\n            as Saturday hostilities persisted to early hours of Monday,\" Monday Kassah, head of the\n            local government in Bokkos, Plateau State, told AFP. Military gangs, locally called\n            \"bandits\", launched \"well-coordinated\" attacks in \"not fewer than 20 different\n            communities\" and torched houses, Kassah said.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/rest-of-world/attacks-kill-at-least-160-people-in-central-nigeria/articleshow/106274760.cms",
        "guid": "https://timesofindia.indiatimes.com/world/rest-of-world/attacks-kill-at-least-160-people-in-central-nigeria/articleshow/106274760.cms",
        "pubDate": "2023-12-26T03:13:55+05:30",
        "enclosure": ""
      },
      {
        "title": "Ukraine celebrates Christmas on December 25 for the first time, distancing itself\n            from Russia",
        "description": {
          "#text": "Christmas in Ukraine\n            carries more weight this year as the country observes it as a public holiday on Dec. 25,\n            reflecting their national identity and opposition to the Russian invasion. Ukraine's\n            predominantly Orthodox Christian faith is divided between two churches, one of which had\n            long affiliation with the Russian Orthodox Church. The change to Dec. 25 was embraced by\n            many Ukrainians as a move towards historical justice and the traditions of their\n            country. Celebrations took place in various locations, including an open-air museum in\n            Kyiv and the village of Kryvorivnia.",
          "img": ""
        },
        "link": "https://timesofindia.indiatimes.com/world/europe/ukraine-celebrates-christmas-on-december-25-for-the-first-time-distancing-itself-from-russia/articleshow/106274754.cms",
        "guid": "https://timesofindia.indiatimes.com/world/europe/ukraine-celebrates-christmas-on-december-25-for-the-first-time-distancing-itself-from-russia/articleshow/106274754.cms",
        "pubDate": "2023-12-26T03:10:21+05:30",
        "enclosure": ""
      }
    ]
  }
}
